using System;
using System.Collections.Generic;
using System.Text;

namespace WPF_CheckListQuests
{
    class TODO
    {
        /*Тест - сделать так что бы выбраные ответы оставлись того же цвета при выбре другого окна*/
        /*Тест - разделить поле коментария на (верно/неверно) и сам коментарий,  (верно/неверно) должно быть жирным, цветным и по центру, коментарий во всю длину*/
        /*Тест - найти решение как изменит цвет выделения на желытй*/
        /*Тест - найти решение как из программы поменять цвет верных и не верных ответов, и их жирность, после данного ответа*/
        /*Тест - При завершеннии теста отображется неврное значение с цифрой правильных овтетов*/

        /*ЛИСТ - добавить возможность удаления из листа через клавшу делете*/
        /*ЛИСТ - добавить водяные знаки для полей ввода*/


        /*Загрузка и сохранение - добавить всплывающие подсказки ко всем эл-там*/
        /*Загрузка и сохранение - Разобратся как использовать CalorDialog и поместить его проект*/

        /*Приложение не запускается на других компах, что делать*/

        /*Добавить дополнительный блок div в конец верстки или даже два


        /*Поставить изменения для возниконовния спойлиров в верстке - исправлено*/
        /*После добавления первого вопрсоа написано что вопросов в копилке 2* - Исправлено/
  
        /*КакаЯ-то проблема с нарушением чтения из блакнота - Исправлено*/
    }
}
