using System;
using System.Collections.Generic;
using System.Text;

namespace WPF_CheckListQuests
{
    class TODO
    {
        /*Тест - сделать так что бы выбраные ответы оставлись того же цвета при выбре другого окна*/
        /*Тест - разделить поле коментария на (верно/неверно) и сам коментарий,  (верно/неверно) должно быть жирным, цветным и по центру, коментарий во всю длину*/
        /*Тест - найти решение как изменит цвет выделения на желытй*/
        /*Тест - найти решение как из программы поменять цвет верных и не верных ответов, и их жирность, после данного ответа*/


        /*ЛИСТ - добавить возможность удаления из листа через клавшу делете*/
        /*ЛИСТ - добавить водяные знаки для полей ввода*/


        /*Загрузка и сохранение - добавить всплывающие подсказки ко всем эл-там*/
        /*Загрузка и сохранение - Разобратся как использовать CalorDialog и поместить его проект*/

        /**/

    }
}
